FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1768/LPC1768_USBHost.c
T_uezError Host_InterruptOut(
            void *aWorkspace,
            TUInt8 aDeviceAddress,
            TUInt8 aEndpoint,
            const TUInt8 *aBuffer,
            TUInt32 aSize,
            TUInt32 aTimeout)
{
    // TBD:
    return UEZ_ERROR_NOT_SUPPORTED;
}

T_uezError Host_InterruptIn(
            void *aWorkspace,
            TUInt8 aDeviceAddress,
            TUInt8 aEndpoint,
            TUInt8 *aBuffer,
            TUInt32 aSize,
            TUInt32 aTimeout)
{
    // TBD:
    return UEZ_ERROR_NOT_SUPPORTED;
}

T_uezError Host_SetConfiguration(
            void *aWorkspace,
            TUInt8 aDeviceAddress,
            TUInt32 aConfigurationNum)
{
    return Host_CtrlSend(
            aWorkspace,
            0,
            aDeviceAddress,
            USB_HOST_TO_DEVICE | USB_RECIPIENT_DEVICE,
            SET_CONFIGURATION,
            aConfigurationNum,
            0,
            0,
            TIMEOUT_STANDARD);
}

T_uezError Host_SetControlPacketSize(
            void *aWorkspace,
            TUInt8 aDeviceAddress,
            TUInt16 aPacketSize)
{
    PARAM_NOT_USED(aWorkspace);

    if (aPacketSize > 256)
        return UEZ_ERROR_ILLEGAL_PARAMETER;

    EDCtrl->Control = (aPacketSize << 16);

    return UEZ_ERROR_NONE;
}

T_uezError Host_ConfigureEndpoint(
        void *aWorkspace,
        TUInt8 aDeviceAddress,
        TUInt8 aEndpointAndInOut,   // bit 0x80 is set if IN
        TUInt16 aMaxPacketSize)
{
//    T_LPC1768_USBHost_Workspace *p = (T_LPC1768_USBHost_Workspace *)aWorkspace;

    // For now, we'll set the one endpoint
    if (aEndpointAndInOut & 0x80) {
        EDBulkIn->Control =
            aDeviceAddress | // USB Address
            ((aEndpointAndInOut & 0x7F) << 7) | // Endpoint address
            (2 << 11) | // direction
            (aMaxPacketSize << 16);
    } else {
        EDBulkOut->Control =
            aDeviceAddress | // USB Address
            ((aEndpointAndInOut & 0x7F) << 7) | // Endpoint address
            (1 << 11) | // direction
            (aMaxPacketSize << 16);
    }

    return UEZ_ERROR_NONE;
}


const HAL_USBHost G_LPC1768_USBHost_Interface_PortA = {
    // T_halInterface iInterface
    {
        "LPC1768:USBHost:PortA",
        0x0100,
        LPC1768_USBHost_InitializeWorkspace_PortA,
        sizeof(T_LPC1768_USBHost_Workspace),
    },

    Host_SetCallbacks,
    Host_Init,
    Host_ResetPort,
    Host_ResetBuffers,
    Host_AllocBuffer,
    Host_ProcessTD,
    Host_GetState,

    Host_SetControlPacketSize,
    Host_SetAddress,
    Host_ConfigureEndpoint,
    Host_SetConfiguration,

    Host_Control,
    Host_GetDescriptor,
    Host_GetString,
    Host_BulkOut,
    Host_BulkIn,
    Host_InterruptOut,
    Host_InterruptIn,
};


/*---------------------------------------------------------------------------*
 * Requirement routines:
 *---------------------------------------------------------------------------*/
//void LPC1768_USBHost_VBUS_Require(T_uezGPIOPortPin aPin)
//{
//    static const T_LPC1768_IOCON_ConfigList pins[] = {
//            {GPIO_P1_30, IOCON_A_DEFAULT(2)}, // USB_VBUS
//    };
//    HAL_DEVICE_REQUIRE_ONCE();
//    LPC1768_IOCON_ConfigPinOrNone(aPin, pins, ARRAY_COUNT(pins));
//
//}
void LPC1768_USBHost_PortA_Require(const T_LPC1768_USBHost_Settings *aSettings)
{
    static const T_LPC1768_IOCON_ConfigList pinsDP1[] = {
            {GPIO_P0_29, IOCON_U_DEFAULT(1)}, // USB_D+1
    };
    static const T_LPC1768_IOCON_ConfigList pinsDM1[] = {
            {GPIO_P0_30, IOCON_U_DEFAULT(1)}, // USB_D-1
    };
    static const T_LPC1768_IOCON_ConfigList pinsCONNECT1[] = {
            {GPIO_P2_9,  IOCON_D_DEFAULT(1)}, // USB_CONNECT1
    };
    static const T_LPC1768_IOCON_ConfigList pinsUP_LED1[] = {
            {GPIO_P1_18, IOCON_D_DEFAULT(1)}, // USB_UP_LED1
    };
    static const T_LPC1768_IOCON_ConfigList pinsINT1[] = {
            {GPIO_P1_27, IOCON_D_DEFAULT(1)}, // USB_INT1n
    };
    static const T_LPC1768_IOCON_ConfigList pinsSCL1[] = {
            {GPIO_P1_28, IOCON_D_DEFAULT(1)}, // USB_SCL1
            {GPIO_P0_28, IOCON_I_DEFAULT(2)}, // USB_SCL1
    };
    static const T_LPC1768_IOCON_ConfigList pinsSDA1[] = {
            {GPIO_P1_29, IOCON_D_DEFAULT(1)}, // USB_SDA1
            {GPIO_P0_27, IOCON_I_DEFAULT(2)}, // USB_SDA1
    };
    static const T_LPC1768_IOCON_ConfigList pinsTX_E1[] = {
            {GPIO_P1_19, IOCON_D_DEFAULT(1)}, // USB_TX_E1
    };
    static const T_LPC1768_IOCON_ConfigList pinsTX_DP1[] = {
            {GPIO_P1_20, IOCON_D_DEFAULT(1)}, // USB_TX_DP1
    };
    static const T_LPC1768_IOCON_ConfigList pinsTX_DM1[] = {
            {GPIO_P1_21, IOCON_D_DEFAULT(1)}, // USB_TX_DM1
    };
    static const T_LPC1768_IOCON_ConfigList pinsRCV1[] = {
            {GPIO_P1_22, IOCON_D_DEFAULT(1)}, // USB_RCV1
    };
    static const T_LPC1768_IOCON_ConfigList pinsRX_DP1[] = {
            {GPIO_P1_23, IOCON_D_DEFAULT(1)}, // USB_RX_DP1
    };
    static const T_LPC1768_IOCON_ConfigList pinsRX_DM1[] = {
            {GPIO_P1_24, IOCON_D_DEFAULT(1)}, // USB_RX_DM1
    };
    static const T_LPC1768_IOCON_ConfigList pinsRX_LS1[] = {
            {GPIO_P1_25, IOCON_D_DEFAULT(1)}, // USB_LS1n
    };
    static const T_LPC1768_IOCON_ConfigList pinsSSPND1[] = {
            {GPIO_P1_26, IOCON_D_DEFAULT(1)}, // USB_SSPND1n
    };
    static const T_LPC1768_IOCON_ConfigList pinsPPWR1[] = {
            {GPIO_P1_19, IOCON_D_DEFAULT(2)}, // USB_PPWR1n
    };
    static const T_LPC1768_IOCON_ConfigList pinsPWRD1[] = {
            {GPIO_P1_22, IOCON_D_DEFAULT(2)}, // USB_PWRD1
    };
    static const T_LPC1768_IOCON_ConfigList pinsOVRCR1[] = {
            {GPIO_P1_22, IOCON_D_DEFAULT(2)}, // USB_OVRCR1n
            {GPIO_P1_27, IOCON_D_DEFAULT(2)}, // USB_OVRCR1n
    };
    static const T_LPC1768_IOCON_ConfigList pinsHSTEN1[] = {
            {GPIO_P1_25, IOCON_D_DEFAULT(2)}, // USB_HSTEN1n
    };

    HAL_DEVICE_REQUIRE_ONCE();
    // Register USB Host driver ports for LPC24xx
    HALInterfaceRegister("USBHost:PortA",
            (T_halInterface *)&G_LPC1768_USBHost_Interface_PortA, 0, 0);
//    LPC1768_USBHost_VBUS_Require(aSettings->iVBUS);
    LPC1768_IOCON_ConfigPin(aSettings->iDP, pinsDP1, ARRAY_COUNT(pinsDP1));
    LPC1768_IOCON_ConfigPin(aSettings->iDM, pinsDM1, ARRAY_COUNT(pinsDM1));
    LPC1768_IOCON_ConfigPinOrNone(aSettings->iCONNECT, pinsCONNECT1,
            ARRAY_COUNT(pinsCONNECT1));
    LPC1768_IOCON_ConfigPinOrNone(aSettings->iUP_LED, pinsUP_LED1,
            ARRAY_COUNT(pinsUP_LED1));
    LPC1768_IOCON_ConfigPinOrNone(aSettings->iINTn, pinsINT1,
            ARRAY_COUNT(pinsINT1));
    LPC1768_IOCON_ConfigPinOrNone(aSettings->iSCL, pinsSCL1,
            ARRAY_COUNT(pinsSCL1));
    LPC1768_IOCON_ConfigPinOrNone(aSettings->iSDA, pinsSDA1,
            ARRAY_COUNT(pinsSDA1));
    LPC1768_IOCON_ConfigPinOrNone(aSettings->iTX_E, pinsTX_E1,
            ARRAY_COUNT(pinsTX_E1));
    LPC1768_IOCON_ConfigPinOrNone(aSettings->iTX_DP, pinsTX_DP1,
            ARRAY_COUNT(pinsTX_DP1));
    LPC1768_IOCON_ConfigPinOrNone(aSettings->iTX_DM, pinsTX_DM1,
            ARRAY_COUNT(pinsTX_DM1));
    LPC1768_IOCON_ConfigPinOrNone(aSettings->iRCV, pinsRCV1,
            ARRAY_COUNT(pinsRCV1));
    LPC1768_IOCON_ConfigPinOrNone(aSettings->iRX_DP, pinsRX_DP1,
            ARRAY_COUNT(pinsRX_DP1));
    LPC1768_IOCON_ConfigPinOrNone(aSettings->iRX_DM, pinsRX_DM1,
            ARRAY_COUNT(pinsRX_DM1));
    LPC1768_IOCON_ConfigPinOrNone(aSettings->iLSn, pinsRX_LS1,
            ARRAY_COUNT(pinsRX_LS1));
    LPC1768_IOCON_ConfigPinOrNone(aSettings->iSSPNDn, pinsSSPND1,
            ARRAY_COUNT(pinsSSPND1));
    LPC1768_IOCON_ConfigPinOrNone(aSettings->iPPWRn, pinsPPWR1,
            ARRAY_COUNT(pinsPPWR1));
    LPC1768_IOCON_ConfigPinOrNone(aSettings->iPWRDn, pinsPWRD1,
            ARRAY_COUNT(pinsPWRD1));
    LPC1768_IOCON_ConfigPinOrNone(aSettings->iOVRCRn, pinsOVRCR1,
            ARRAY_COUNT(pinsOVRCR1));
    LPC1768_IOCON_ConfigPinOrNone(aSettings->iHSTENn, pinsHSTEN1,
            ARRAY_COUNT(pinsHSTEN1));
}


/*-------------------------------------------------------------------------*
 * End of File:  LPC1768_USBHost.c
 *-------------------------------------------------------------------------*/
